Revit 2026 API

# RebarConstraintsManagerApplyRebarConstraints Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ApplyRebarConstraints(
	IList<RebarConstraint> constraintsToApply,
	IList<Reference> oldTargets,
	IList<Reference> newTargets
)
```
```vb
Public Function ApplyRebarConstraints (
	constraintsToApply As IList(Of RebarConstraint),
	oldTargets As IList(Of Reference),
	newTargets As IList(Of Reference)
) As Boolean
```
```cpp
public:
bool ApplyRebarConstraints(
	IList<RebarConstraint^>^ constraintsToApply,
	IList<Reference^>^ oldTargets,
	IList<Reference^>^ newTargets
)
```
```fsharp
member ApplyRebarConstraints :
        constraintsToApply : IList<RebarConstraint> *
        oldTargets : IList<Reference> *
        newTargets : IList<Reference> -> bool
```

#### Parameters

constraintsToApply IListRebarConstraint

oldTargets IListReference

newTargets IListReference

#### Return Value

Boolean

#### Reference

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace